[
{"id":0,"name":"Meat Sauce with Spaghetti","serving":"4","instructions":"DAY 1 \nMethod for sauce\nSweating mirepoix: In your large stock pot, heat the olive oil, for 20 seconds, on 6/medium high heat. Add the onion, celery and carrots, stir to coat the veggies with oil then put the lid on the pot completely and turn the heat to 4/medium low to sweat. After 1 minute, remove the lid, allowing the condensation on the lid to drip into the pot, stir the veggies and make sure they are not burning. (If looking toasty, add 2T of water, stir and return the lid to the pot).\n\nAfter 5 minutes of sweating the veggies add the garlic and continue sweating all veggies until the carrots are nice and soft. \n\nSaute beef: Add the ground beef and saute over medium/4 heat. Stir frequently and break up any large lumps and cook until most meat is no longer pink, about 5 minutes. \n\nSeason and bloom the spices: Add the dried basil, the parsley, the salt and pepper, stir in. Give the basil and parsley about 3 minutes to hydrate/bloom and wilt. \n\nToast the paste: Add the tomato paste and stir to coat all veggies. Stir constantly for 1 minute until the tomato paste begins to darken, thicken and toast. \n\nSimmer: Add the chopped tomatoes, the tomato sauce and the water, and bring to a simmer, then reduce to 3/medium heat. Place the lid AJAR on the pot (iIf you do not vent the pot the sauce will not thicken).\n\nLow simmer for 20 minutes, stirring occasionally.\n\nStore in a stainless steel container or plastic container and mark with green tape. Allow to cool before covering.\n\nDAY 2\nNow for the pasta\nFill a medium pot, ¾ of the way with water and add the 2T salt. Bring water to a boil, add the noodles and simmer for about 13 minutes.\n\nReheat sauce in a large pan with ½ cup of water. Bring to a low simmer over low heat/3. \n\nAssembling\nWhen the noodles have cooked, reserve ½ cup of pasta water then drain them well in a colander. Return drained noodles to the stock pot and add sauce quantity to your liking. Add 1-2T of pasta water and over low heat mix together. \n\nTop with parm cheese and serve.\n","ingredients":"Day 1 Ingredients for meat sauce\n2 T olive oil\n1 medium onion, minced (1 cup)\n1 carrot, peeled and GRATED (½ cup)\n2 celery stalks, minced (½ cup)\t\n2-4 garlic cloves, peeled and minced\t\n\n¾# or 12 oz ground beef\n2 teaspoons dried basil\n1 teaspoon salt\n1 teaspoon black pepper\n\n2 T tomato paste\n14-ounces crushed tomatoes\n1 cups tomato sauce\n1 cup water\n1/4 cup/5 stems flat-leaf Italian parsley, chopped \n\nDAY 2 Ingredients for spaghetti\n¾# spaghetti noodles\n2T salt, for salting the water\n1/4 cup grated Parmesan cheese\n","picture":"https://thedashleyskitchen.com/wp-content/uploads/2022/09/Spaghetti-Sauce-Served-over-bed-of-pasta-.jpg"},
{"id":1,"name":"S'mores Cookies","serving":"24","instructions":"1. Whisk the flour, baking soda, and salt together in a medium bowl. Set aside.\n\n2. In a separate bowl, beat together the butter and granulated sugar until smooth, about 1 minute.\nThen, add the brown sugar and beat until creamy, about 30 seconds.\n\n3. Add the 2 eggs and vanilla and beat until combined.\nAdd the dry ingredients to the wet ingredients, and mix on low until combined and no streaks of flour remain.\n\n4. Stir in the chocolate chips.\n\n5. Using a 1 tablespoon measure, scoop out 6 balls of dough. Press a marshmallow chunk on top of one dough ball.\n\n6. Place another one-tablespoon-sized dough ball on top of each marshmallow. Use your fingers to seal the edges together as best as you can, and then roll the cookie dough ball so that the marshmallow is completely hidden inside the dough ball. Repeat with the rest of the dough, making 24 cookies total.\n\n7. Place the cookies on a plate (or keep on the baking sheet if it fits). Then, break 3 graham cracker sheets into 12 pieces each (break into the four quadrants following the lines on the cracker and then each quadrant into 3 smaller pieces). We’re putting 3 small pieces of graham cracker in each cookie, so we need 72 pieces of graham cracker from 6 whole sheets. Each quadrant of a graham cracker makes 3 pieces for one cookie. Six sheets will be enough pieces for all 12 cookies. (The remaining graham cracker sheet will be crushed and sprinkled over the cookies after baking). Press three small pieces of graham cracker into each dough ball.\n\n8. Refrigerate the cookie dough balls for 30 minutes while you preheat the oven to 350 F..\n\n9. Space 6 cookie dough balls evenly on a large baking sheet, and add a few extra chips on top of each cookie. Bake for 11-13 minutes, until the cookies are starting to turn golden brown around the edges.\n\n10. Right when the cookies come out of the oven, use your fingers to crush the remaining graham cracker sheet and sprinkle it over the cookies while still warm. Then, let the cookies cool completely on the cookie sheet (so that the marshmallow doesn’t stick to the pan!)","ingredients":"2 c AP-flour\n1 t baking soda\n½ t salt\n6 oz unsalted butter\n1 cup granulated sugar\n6 T brown sugar\n2 large Eggs\n2 t vanilla extract\n1½ c chocolate chips\n12 large marshmallows, snipped in half\n8 whole graham cracker sheets","picture":"/smores.jpg"},
{"id":2,"name":"No-Rise Cinnamon Rolls\n","serving":"8","instructions":"Heat oven to 375 F convection. Lightly grease an 8 or 9-inch round or square cake pan.\n\nMake the filling: In a medium bowl, using a wooden spoon, mix butter, brown sugar and cinnamon until smooth. Set aside.\n\nMake the rolls: In a large bowl, whisk together the flour, baking powder, salt and baking soda. Add the oil and use a wooden spoon to mix until incorporated. (It might be a little lumpy. That’s OK!) Stir in the buttermilk until just blended. Gather the dough into a ball and knead on a lightly floured surface until smooth, about 1 minute. Roll out the dough into a 16-by-9-inch rectangle.\n\nGently spread the filling evenly over the dough, right to the edge. Starting from one of the long sides, roll up the dough into a tight cylinder (hotdog). Rotate the roll so that the seam is against the work surface. Using a piece of dental floss, cut the roll crosswise into eight equal slices. Transfer the rolls to the prepared pan, spacing them evenly. (At this point, you can wrap with plastic wrap and refrigerate for a day or 2, or freeze for up to 3 months. Allow to come to room temperature before proceeding.)\nBake for 17-20 minutes, or until golden.\n\nWhile the rolls bake, make the frosting: In a medium bowl, using a rubber spatula or wooden spoon, beat the cream cheese until smooth. Add the confectioners’ sugar and beat well. Add the milk and vanilla, and beat until smooth and creamy. Set aside.\n\nRemove the rolls from the oven and allow to cool for 3 to 4 minutes before coating with the glaze. Serve warm.\n","ingredients":"Ingredient for filling\n½ cup butter, very soft, plus 1t greasing the pan\n⅓ - ½ cup brown sugar\n1 ½ teaspoons cinnamon\n\nIngredient for dough\n2 cups flour, plus more for work surface\n1 tablespoon baking powder\n1 teaspoon fine salt\n¼ teaspoon baking soda\n¼ cup canola or vegetable oil\n¾ cup buttermilk\n\nIngredient for frosting\n3 ounces cream cheese, very soft\n¾ cup confectioners sugar, sifted if lumpy\n1 teaspoon whole milk\n½ teaspoon vanilla extract","picture":"https://www.abakingjourney.com/wp-content/uploads/2019/11/Cinnamon-Rolls-featuree-e1573794562426.jpg"},
{"id":3,"name":"Smashburgers","serving":"1","instructions":"Divide the ground beef into ¼ # pieces, one per person. Make a firm ball of beef and season each burger with ¼ teaspoon salt on all sides. Set aside.\nWarm two cast iron pans over medium heat/7 and add a couple drops of oil to the smaller pan for toasting the buns. Toast the buns on the pans by GENTLY pressing them into the warm oil. Toast until the surface is golden. Repeat with all buns. Transfer the toasted buns to a serving plate.\n\nIncrease the heat on the large pan to medium-high/8 and keep a careful eye on the pans. Sprinkle some water onto the pan, if it sizzles you are ready to smash your burgers. \n\nTransfer 1-2 burger balls to the hot pans leaving a little space between each patty. The burgers should sizzle on contact — if they don't, remove beef and wait for the pan to heat up. Work in batches if necessary. \n\nPlace a piece of small parchment on the burger and press down to smash, using a small stainless bowl. Smash until pretty thin, this will ensure even cooking, fast cooking and nice crispy edges. Add the sliced onions if you want caramelized onions on your burger. You are ready to flip the burger when you see a dark brown sear on the underside. Flip!  Cook for another 2 minutes or until you see a very thin red line of raw beef. ADD THE CHEESE, remove from the heat, COVER THE PAN with a cooking sheet, and give cheese about 2 min to melt.  \n\nTransfer the burger directly to the toasted buns and garnish with your favorite burger toppings.","ingredients":"¼ # 80/20 ground beef\n¼ teaspoon salt\n1 bun\n1 piece of cheddar cheese\n¼ yellow onion, THINLY sliced\nOptional garnishes: dill pickles, iceberg lettuce, onions, ketchup, mustard, mayo","picture":"https://theninjacue.com/wp-content/uploads/2024/04/15-erin_hungsberg-0r4a4267-ninjacue-oklahoma-smash-burgers-24-3-768x614.jpg"},
{"id":4,"name":"Chocolate Cupcakes","serving":"11","instructions":"Preheat the oven to 350°F/325 F convection. Line a 12-cup muffin pan with 11 cupcake liners. \n\nMelt the cubed butter, chopped chocolate and cocoa in a stainless bowl over a pot of barely simmering water. Stirring occasionally. Set aside to cool. \n\nWhisk the flour, baking powder, and baking soda together in a large bowl until thoroughly combined. Set aside. \n\nIn a medium bowl, whisk the eggs; add the granulated sugar, vanilla and salt together until completely smooth. Add the cooled chocolate mixture and mix until combined. Sift about ⅓ of the flour mixture over the chocolate mixture and whisk until combined, whisk in the sour cream, mix, then sift the remaining flour mixture over the batter and combine. \n\nDivide the batter evenly into the prepared muffin cups. Bake until a toothpick inserted comes out clean, about 18 minutes. \n\nRemove from the pan and palace on a wire rack to cool completely. \n","ingredients":"4 ounces butter, cut into 4 pieces. \n2 ounces bittersweet chocolate, chopped\n½ cup cocoa powder\n3 ¾ ounces AP flour\n¾ teaspoon baking powder\n½ teaspoon baking soda\n2 eggs, room temperature\n5 ¼ ounces sugar\n1 teaspoon vanilla extract\n½ teaspoon salt\n½ cup sour cream","picture":"/cupcakes.jpg"},
{"id":5,"name":"Taco Torte","serving":"4-5","instructions":"Heat the oven to 400°F. \n\nCoat a 9-inch springform with nonstick spray. This is the vessel you will build your torte in.\n\nHeat 2 tablespoons of oil in a large skillet over medium-high heat. Fry the tortillas, one at a time, until crisped and browned on both sides. Drain on paper towels and set aside to cool.\n\n\nHeat the remaining 1T oil in a large skillet over medium heat. Add the onion, ground beef, garlic, jalapeno pepper (if using), cumin, chili powder, and and cook until you can smell the spices and the onion is softened and the beef is almost fully cooked, about 10 minutes. Stir in the tomatoes with the 1/4 cup of reserved juice and the tomato paste, then stir in the beans and add the salt. Let the meat mixture simmer until everything is hot, about 5 minutes. Add the corn, spinach, and stir until the spinach has wilted and everything is well blended and hot, about 3 minutes. Taste for seasoning, adding more salt and/or pepper as necessary. Add the green onions and cook for one minute.\n\nPlace 1 tortilla in the prepared cake pan. Spread ¼ (just eyeball it) of the bean and vegetable mixture evenly over the tortilla, then sprinkle ¼ cup of the shredded cheese evenly over the top. Repeat with 3 more layers, ending with the last of the bean mixture and shredded cheese on top.\n\nBake the tortilla stack until it is hot throughout and the top is lightly browned, about 20 minutes. You can run it under the broiler for extra color on top, if you wish. Remove it from the pan, by carefully opening the springform sides. \n\nMove torte from springform bottom to a cutting board and cut it into wedges using a sharp knife and serve it with a spatula or better yet a pie server. Sprinkle the top with cilantro, if desired, and serve with sour cream and/or salsa on the side, if you like.\n","ingredients":"Nonstick cooking spray\n3 T vegetable or canola oil\n4 medium-size (8-inch) flour tortillas (although corn should work too)\n1 cup onion, chopped small\t\t\t\n2 cloves garlic, minced\n½ # ground beef \n½ fresh jalapeno or ⅓ cup canned chopped green chilies \n2 t ground cumin\n3 t chili powder \n1 ½ cups chopped/crushed tomatoes \n¼ cup tomato paste\n¾ cup black beans, drained and rinsed\n1 t salt \n1 cup corn kernels, drained and rinsed\n2 cups rough-chopped spinach leaves\n½ cup green onions, sliced\n1 ½  cup (6 ounces) shredded Monterey Jack or cheddar cheese \n¼ cup sour cream, to top, optional\n","picture":"https://i0.wp.com/smittenkitchen.com/wp-content/uploads//2016/02/taco-torte1.jpg?fit=640%2C427&ssl=1"},
{"id":6,"name":"Pumpkin Bread","serving":"4","instructions":"Preheat the oven to 315 F convection. Generously grease four pans with oil and line with parchment.\n\nIn a medium bowl, combine the flour, salt, baking soda, baking powder, cloves, cinnamon and nutmeg. Whisk to combine. Set aside. \n\nIn your KitchenAid Mixer with a paddle attachment, beat the butter and sugar together on medium speed, scraping down the sides then add the eggs one at a time. Beat well to combine and until it is light and fluffy. Beat in the pumpkin. The mixture should look grainy and curdled at this point - that’s okay. \n\nAdd the flour mixture and mix on low speed until combined. \n\nTurn the batter into the four prepared pans, dividing equally by weight. Bake for about 40-45 minutes, or until a kitchen knife comes out clean. \n\nWhile baking make the glaze by combining all ingredients and set aside.\n\nAllow to cool in pans for 5 minutes before turning out onto a wire rack. When cooled, drizzle glaze over the top, allowing it to harden and wrap to go. \n","ingredients":"Ingredients for bread\n2 cups AP flour\n½ t kosher salt\n1 t baking soda\n½ t baking powder\n1 t ground cloves\n1 t ground cinnamon\n1 t ground nutmeg\n12T butter, softened\n2 cups sugar\n2 eggs\n15 oz 100% pure pumpkin\n\nIngredients for glaze\n½ cup powdered sugar, sifted\n2T maple syrup\n1 -2 T milk or water\n","picture":"https://www.seriouseats.com/thmb/8s50PFAkoetVAaqTBJdnCxlfInA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2020__10__20201014-pumpkin-bread-vicky-wasik-beauty-d2ea76b19e4a4ab5adae684b9171f1ed.jpg"},
{"id":7,"name":"Pizza","serving":"4","instructions":"Method for pizza dough\nPlace the yeast and sugar in a small bowl. Measure 1 cup warm water (110-115F) in a glass liquid measuring cup. When you have the correct temperature, add the yeast/sugar combo and gently stir with a spoon until the yeast and sugar have dissolved. Set aside for about 5-7 minutes and watch the yeast grow and bubble!\n\nTo a large bowl add the flour and salt, mix. Make a well in the middle. Add the oil and the foaming yeast mixture. Gently mix with a wooden spoon. When the dough becomes too stiff to stir, flour your hands and your countertop and place the dough onto the countertop. Knead the dough for 8-10 minutes so you build the gluten in the flour, adding flour to keep it from sticking to anything. The dough should feel soft and smooth and no longer sticky when it has been kneaded enough. \n\nPlace dough inside of your LABELED (label with kitchen name and period ) Ziploc bag, and place it on the tray on the runway.\n\nMethod for pizza sauce \nPlace all items in a blender and blend until smooth. Taste and balance acid, sweet and salt flavors. When you think you have the perfect balance, pour sauce into a container, cover and label with kitchen name and period and place it on the runway with pizza dough.\n\n\nDay 2 - assembling pizza\n\nPreheat the oven to 475-500 F convections. \n\nKnead dough two times to work out any air bubbles. Dust hands with flour and form dough into a round pizza patty and let rest for 5 minutes. After 5 minutes, stretch the dough to the thickness you like. Let gravity do a lot of the work. Go thinner than you think, really stretch it, you may be able to get two pizzas out of this! Place crust(s) on cookie sheet(s) and with your fingers pinch a little raised rim around the edge of your pizza dough shape (it does not have to be round).\n\nWith a spoon, spread the pizza sauce over the dough. Sprinkle with cheese and additional toppings. \n\nPlace pizza on bottom rack and bake until the cheese has melted, the crust is a dark golden brown and the underside of the crust is dark golden brown and crunchy looking, about 10 minutes, move to the upper rack half way through. Use a spatula to lift the pie to check the bottom.\n\nWhen golden brown on the bottom, remove from the oven. Either cut with kitchen shears on the cookie sheet or move pizza to a cutting board if you use the pizza cutter. \n","ingredients":"Day 1 - Pizza dough ingredients\n1 ½ teaspoon yeast\n1 teaspoon sugar\n1 cup warm water (110-115F)\n2 tablespoons olive oil\n2 teaspoons salt\n2 ½ cup bread flour\n\nPizza sauce ingredients\n1 garlic clove, minced (or ½ t garlic powder)\n½ teaspoon salt\n¼ teaspoon black pepper\n½ teaspoon dried oregano\n½ teaspoon dried basil\n3 T tomato paste\n1 cup chopped tomatoes with sauce\n1-2 T water, to thin sauce if necessary\n\nDay 2\n7 ounces mozzarella cheese\t\n2 toppings of your choice (3 oz pepperoni, ½ cup sausage, 2oz canadian bacon, olives, red onion, basil, green bell pepper, pineapple, jalapeno, fresh tomato, etc)\t","picture":"https://www.simplyrecipes.com/thmb/pjYMLcsKHkr8D8tYixmaFNxppPw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__simply_recipes__uploads__2019__09__easy-pepperoni-pizza-lead-3-8f256746d649404baa36a44d271329bc.jpg"},
{"id":8,"name":"Breakfast Sandwiches","serving":"4","instructions":"FIRST, place the buttered English muffins in the cast iron to toast, over 3/4 heat. Press down in the middle and edges of the muffin so they toast evenly, flip over when golden. DO WATCH THEM CLOSELY. Remove from pan when toasted.\n\n\nSECOND, in a cast iron pan, over medium heat/5, place the 4 patties into the pan, sear on the first side for 3 minutes, gently pressing down with a spatula to ensure even cooking, then flip and cook for an additional 3 minutes.  Time will really depend on the thickness of the patty. Watch closely. Reduce the pan to low/2, or remove from heat completely, and leave the sausage on the pan for the next step...see below.\n\n\nTHIRD, add the salt and pepper to the eggs and combine. In a small stainless pan, over low/3, melt the butter. When you see the butter foaming, reduce the heat to 2 and add the eggs. Low heat ensures that the proteins won’t seize and become rubbery. Your result will be a delicate and fluffy egg. Leave eggs undisturbed for 30 seconds, stir gently, leave for another 30 seconds and stir again. The eggs will be done in about 4 minutes total. They should be creamy and not broken up too much. Remove eggs from heat and divide into 4 pieces.\n\n\nFOURTH, assemble! On top of a toasted bun place sausage patty, one piece of egg and one piece of cheese, top with the other side of the bun. Then cover with a lid to melt the cheese.","ingredients":"Ingredients for scrambled eggs\n4 eggs, at room temperature, whisked in a bowl\n½ t salt\nA pinch (⅛ t) black pepper\n2 t butter, for pan \nIngredients for sandwich\n½ # bulk sausage, portioned for patties\n4 English muffins, divided and buttered\n2 T butter for buttering muffins\n4 slices of cheddar cheese\n4 pieces of scrambled egg (steps to follow)\n","picture":"https://www.chefsouschef.com/wp-content/uploads/2024/02/sausage-and-egg-breakfast-sandwich-feature.jpg"},
{"id":9,"name":"Macaroni and Cheese ","serving":"4","instructions":"Preheat the oven to 325 F, convection. \n\nSTEEPING MILK: In the small pot combine the milk, bay leaf, allspice berries, red pepper flakes, ¾ teaspoon salt and peppercorns over 5 heat. Bring the milk and spices to a strong simmer (small bubbles, don’t walk away, milk can boil over quickly). Once it hits a simmer, remove the milk from the heat and set aside to steep (milk will absorb spice oil) for 10 minutes. \n\nCOOKING PASTA: Fill the stock pot ⅔ of the way full with water and add 1T salt. Bring the water to a boil/12 and then add the pasta, stir twice, and cook for about 5 minutes. WATCH the pasta, reduce heat so water doesn't boil over. Drain in a colander when pasta is about ¾ of the way cooked, shake in the colander and return to a warm stock pot.\n\nMAKING ROUX: In the medium pot, melt the 2 tablespoons of the butter in a medium saucepan/pot on medium low heat/4. Using a wire whisk or wooden spoon, stir in the 2 tablespoons of flour. Cook and whisk until roux is slightly golden, about 3 minutes. Add the mustard and combine. \n\nMAKING THE BECHAMEL: Pour the steeping milk through a sieve to remove all the solid spices. Into the roux, whisk in ½ cup of the warm milk, once combined add remaining 1½ cups warm milk. Continue to cook, stirring constantly BUT slowly, scraping the bottom to avoid sticking, until the sauce thickens = bechamel. The sauce should coat the back of your wooden spoon. \n\nMAKING THE MORNAY/CHEESE SAUCE: Remove bechamel from the heat and add the cheeses and stir until it melts. \n\nMAKING THE MAC AND CHEESE: Finally, add the mornay sauce to the drained macaroni and mix thoroughly and pour into your 9x9 baking dish, it will be soupy. Place in the oven for 10 minutes or until bubbly and golden brown.\n","ingredients":"2 cups whole milk\n1 bay leaf\n2 allspice berries\n¼ teaspoon red pepper flakes\n¾ teaspoon kosher salt\n1 teaspoon black peppercorns\n\t\t\t\n1 T salt, for stock pot of water\n6 oz elbow macaroni\t\n\n2 tablespoons butter\t\t\t\t\t\t\n2 tablespoons flour\t\t\t\t\t\t\n1 teaspoon Dijon mustard \n¾  cup sharp cheddar cheese, grated \n2 tablespoons parmesan cheese\n","picture":"https://thedailyspeshyl.com/wp-content/uploads/2024/09/baked-mac-and-cheese-7.jpg"},
{"id":10,"name":"Chicken Noodle Soup","serving":"4","instructions":"Heat the oil, over 6 heat, in a large heavy-bottomed stock pot. Add the carrots, celery, onion, dry spices and ½ t salt to the pot. Stir to coat the vegetables with the oil and saute (dry heat cooking) until the mirepoix has color, little bits of brown on edges, or about 7 minutes. The onions should be translucent. Add one tablespoon or two tablespoons of water if spices start to stick to the bottom. Keep stirring occasionally to make sure nothing is burning or sticking to the bottom of the pot. \n\nOnce chicken is cut into small pieces, season it with ½ teaspoon salt and set aside.\n\nIn a medium pot, fill ¾ full of water and bring water to a boil (level 12). Add the egg noodles, reduce heat to a simmer, and cook for about 7-9 minutes or until soft. Drain in a colander and set aside. \n\nWhile the noodles are cooking, add the chicken broth and water to the stock pot. Bring up to a boil (big bubbles)/12, then reduce to a low simmer (small bubbles) 2 or 3 and add the seasoned chicken. Poach chicken for 5 minutes over low heat/2, add cooked noodles and turn off the heat. Season with 1 teaspoon of lemon juice and Worchestire sauce. Taste and add more lemon juice, salt, or pepper to taste. Does your soup have that ZING?? Add parsley, stir, and serve right away.","ingredients":"1 tablespoon vegetable oil\n1 large carrot/1 cup, peeled and diced\n2 whole stalks celery/1.5 cups, diced\n1 medium yellow onion, 1 cup, diced\n1 t dry oregano\n½ t dry thyme\n½ t dry sage \n½ t black pepper\n½ t salt\n\n½ t salt\n¾# chicken meat (thigh), cut into ¼” pieces\n\n3 cups chicken broth \n1 cup water\n2 oz egg noodles \n\n1 teaspoon fresh lemon juice, to taste\n1 t Worcestershire sauce\t\n3 sprigs parsley, destemmed and finely chopped\n","picture":"https://www.olgasflavorfactory.com/wp-content/uploads/2018/10/Chicken-Noodle-Soup-1-2-copy.jpg"},
{"id":11,"name":"Pasta Primavera","serving":"4","instructions":"Preheat the oven to 425 F, convection. \n\nTo the prepped vegetables, add the corn with 2T oil, the salt, the pepper, and the dried herbs to coat. Transfer the vegetable mixture to 2 large baking sheets and arrange evenly making sure there is space between veggies. SAVE THE MIXING BOWL FOR THE KALE. Bake until the carrots are tender, 10-15 minutes, and the vegetables begin to brown on the edges, if they are roasting unevenly, turn the tray. \n\nFill a stock pot ⅔ of the way full with water and add 2T salt to the water. You want your water to taste like the ocean so that the pasta takes on some flavor. Bring the water to a boil and then add the pasta and cook until al dente, about 12 - 15 minutes. \n\nWhile the veggies are roasting, toss the kale in the oil and herb mixture that is remaining in the mixing bowl. When the veggies have a nice goldeness to them, place the kale on the cookie sheets in the oven, mix with other veggies and roast for another 5 minutes. WATCH THE KALE TO MAKE SURE IT DOESN’T BURN. \n\nWhen the pasta is done, drain the pasta very well AND RESERVE 1/2 CUP PASTA WATER FOR YOUR SAUCE. Add the drained pasta to the same large bowl you tossed the raw veggies, toss the cooked pasta that bowl with the roasted veggies. Add the remaining 2T olive oil and enough reserved cooking liquid (2T) to moisten the pasta and make it saucy. Season the pasta with ½ t salt and  ¼ t pepper and finally, toss with the Parmesan and serve immediately.\n","ingredients":"DAY 1: knife work/mise en place \t\n3 carrots, peeled and cut into thin strips\t\t\t\t\n1 small or ½ onion, sliced into half moons\t\t\t\t\n1 red bell pepper, cut into thin strips\t\t\t\t\n1 yellow bell pepper, cut into thin strips\n4 cloves garlic, sliced thickly or left whole\t\t\t\n5 leaves kale, stripped of stem and torn into 2 inch pieces \nDAY 2: roasting and assembling\n2 T salt, for pasta water\n8 oz bowtie pasta\nPrepped carrots\nPrepped onion\nPrepped red bell pepper\nPrepped yellow bell pepper\nPrepped garlic\n½ cup corn\t\t\t\t\t\t\t\t\n¼ cup olive oil, divided into 2T + 2T\t\t\t\t\n1 ½ t salt\n¾ t black pepper\n2 t Italian herbs\n5 leaves kale, stripped of stem and torn into 2 inch pieces or handful of spinach\n½ cup grated Parmesan\n","picture":"https://thecozycook.com/wp-content/uploads/2024/02/Pasta-Primavera-f-500x500.jpg"},
{"id":12,"name":"Corn Chowder with Chilies\n","serving":"4","instructions":"Add cut up bacon to a large stock pot and saute (no lid, dry cooking) on 6/medium heat. Cook until the bacon fat renders out of the bacon. Remove bacon and set aside. Add the diced onion to the bacon fat and stir to combine, add 1 teaspoon of salt and cook until the onion is soft. Stir and add the diced potatoes and season with 1 teaspoon salt. Give the potatoes about 5 minutes then add all three kinds of chilies and the adobo sauce, stir and cook until the jalapeno starts to soften. Now, add the butter, stir to melt, then add the masa and stir to combine. \n\nPour the chicken broth and water into the stock pot and bring to a boil then reduce to a simmer and simmer for 10 minutes. Now, add the corn and stir to combine. Remove 1-2 cups of soup and place into a blender, blend until smooth then return to the stock pot. Stir in the cream and add back the bacon. Bring the contents of the pot to a VERY GENTLE SIMMER with the lid ajar. Taste for the ZING, adding more salt if you like. Maybe a little salt, maybe more adobo sauce?\n","ingredients":"3 slices smokey bacon, cut into ¼ inch pieces\n½ onion, diced\n2 yukon gold or red potatoes, diced into ¼ inch pieces\n2 - 3 t salt, divided\n1 whole chipotle pepper in adobo sauce, finely diced\n1 T adobo sauce, to taste\n½ jalapeno, deseeded and finely minced\n3 oz can of diced green chilies\n2 T butter\n1 T masa/corn meal\n16 oz chicken broth\n8 oz water\n1 ½ cups corn (or 3 ears fresh corn)\n½ cup heavy cream \n","picture":"https://img.taste.com.au/dcmS-CNt/taste/2016/11/corn-and-potato-chowder-with-a-hint-of-chilli-102917-1.jpeg"},
{"id":13,"name":"Fettuccine Alfredo","serving":"4","instructions":"Cooking Order:\nFirst start chicken\nThen start pasta\nThen start sauce\n\nMethod for pasta\nFill a stock pot ⅔ of the way full with water and add 1T table salt to the water. Bring the water to a boil/12 and then add the pasta, give the pasta a stir around so the noodles do not stick together. Then boil and cook until al-dente, about 12 - 15 minutes. When the pasta is done, drain the pasta very well AND RESERVE 2 CUP PASTA WATER FOR THINNING THE ALFREDO SAUCE.\n\nMethod for sauce\nWhile the pasta is cooking, in a large pan, over LOW heat/3, melt the butter and cream. KEEP ON LOW HEAT/3 SO YOU DON’T SCALD THE CREAM. Add the minced garlic and black pepper. Continue to heat until the cream and butter has thickened a bit and coats the back of a wooden spoon. When the sauce has thickened, add the parmesan cheese and mix until all the cheese melts OVER LOW HEAT/3, maybe 5. This will take longer than you think. Add 3T - 5T of warm pasta water to help melt the cheese and bring the sauce together into a creamy yumminess. This will take some time so be patient. Your sauce consistency should not be sticky and thick, but smooth and thickly pourable.\nStrain pasta through a colander after saving 2 cups pasta water. Use your tongs to add enough pasta to the sauce. You may not use all the pasta because your group may want your dish creamier. Use the pasta water to thin your alfredo and make mixing the pasta and sauce easier, just start with ¼ cup of water and add as needed to loosen. You want a nice creamy sauce, not a sticky cheesy sauce. Add chopped chicken, combine and eat. \n\nMethod for chicken\nSlice the chicken breast horizontally: Place the chicken breast on a RED cutting board, place your hand FLAT on the top and use your Chef’s knife to horizontally slice through the breast so that it is even in thickness. Season the chicken breasts on all four sides lightly with salt and pepper and other spices you choose.  \n\nPrepare the pan by heating the sauté pan over medium-high heat/7. Add a drop of water to the pan, does the water separate into 2-3 balls that slip over the surface? If so, the pan is hot enough for the 2T oil. Swirl the pan so it is covered with oil.\n\nReduce the heat to medium/4 and cook the chicken pieces for 1 minute without moving then, flip the chicken pieces over and cook for another minute until golden on one both sides. If the chicken is sticking to the pan, don’t rip it off, just let it cook a little longer. DO NOT SEAR OR BROWN TOO MUCH. \n\nReduce heat to low/1 and cover pan and cook on low for 3 minutes. Set a timer for 3 minutes, and walk away. Do not lift the lid; do not peek.\n\nRemove the pan from the heating element and allow chicken to rest in the pan, with lid for another 7 minutes. Again, do not lift the lid; do not peek. After 7 minutes, the chicken will feel firm. When the chicken has cooked, move from the pan to a clean cutting board. Cut into strips or bite size pieces for 4 people and serve with alfredo.\n","ingredients":"1 T table salt (for cooking water)\n¾#/12oz  fettuccine noodles\n6 T butter\n¾ cup heavy cream\n1 small clove garlic, minced\n½ t black pepper\n¾ cup parmesan cheese\n1 large chicken breast\n2 T oil\nSalt and other spices for seasoning\n","picture":"https://www.allrecipes.com/thmb/6iFrYmTh80DMqrMAOYTYKfBawvY=/0x512/filters:no_upscale():max_bytes(150000):strip_icc()/AR-23431-to-die-for-fettuccine-alfredo-DDMFS-beauty-3x4-b64d36c7ff314cb39774e261c5b18352.jpg"},
{"id":14,"name":"Chocolate Donut Holes","serving":"18","instructions":"Heat oven to 325 degrees convection and generously butter 18 mini muffin wells.\n\nIn a large bowl, combine the egg and 100 grams granulated sugar and whisk until well combined. Add the sour cream, 57 grams melted butter, the oil, nutmeg, instant coffee and salt; whisk until well combined.\n\nWhisk in the cocoa powder, followed by the baking powder and the baking soda. Then use a flexible spatula to fold in the flour by gently scooping up some batter from the bottom and folding it over the flour on the top.GENTLE, don’t overmix. Rotate the bowl and repeat until just incorporated.\n\nDivide the mixture among the 18 wells and bake until the muffins are puffed and a toothpick inserted in the center comes out with a few moist crumbs attached,  9-12 minutes.\n\nFor the glaze: In a shallow bowl, combine the powdered sugar and the water. Use enough water to get thick, drizzable glaze. Let the muffins cool in the pan for 5 minutes then transfer them to a rack. Glaze each muffin when cool and serve immediately. \n","ingredients":"Donut Ingredients\n57 (4T) grams butter, melted, plus more for greasing\n1 large egg\n100 grams granulated sugar (½ cup)\n110 grams sour cream (½ cup)\n1 ½ teaspoons vegetable or canola oil\nA pinch nutmeg, or other spice\n¼ teaspoon instant coffee, optional \n¼ teaspoon kosher salt \n23 grams cocoa powder (¼ cup)\n¾ teaspoons baking powder\n⅛ teaspoon baking soda\n64 grams all-purpose flour (½ cup)\nGlaze Ingredients\n½ cup powdered sugar, sifted\n2-3 teaspoons water\n","picture":"https://sallysbakingaddiction.com/wp-content/uploads/2013/09/Glazed-Chocolate-Donut-Holes-2.jpg"},
{"id":15,"name":"Soft Pretzels","serving":"8","instructions":"Preheat the oven to 450 F/425 F convection and line 2 -sheet pans with parchment paper and spray with canola oil. Set aside.\n\nBring the 9 cups of water and the ½ cup baking soda to a rolling boil in your stock pot.\n\nIn the meantime, turn the dough out onto a lightly oiled work surface and divide into 8 equal pieces. Roll out each piece of dough into a 32-inch rope. Make a U-shape with the rope, holding the ends of the rope, cross them over each other twice and press onto the bottom of the U in order to form the shape of a pretzel. Place onto the parchment-lined sheet pan.\n\nPlace the pretzels into the boiling water, 1 by 1, for 30 seconds. Remove them from the water using a slotted spoon and tongs. Return to the sheet pan, brush the top of each pretzel with the beaten egg yolk and water mixture (this will make them shiny and brown when baked) and sprinkle with salt. If you are going to make sugar cinnamon pretzels, do not add salt at this point, just egg wash. \n\nBake until dark golden brown in color, approximately 8-10 minutes. Rotate pan halfway through the baking time.\n\nTransfer to a cooling rack for at least 5 minutes before serving. \n\nNow butter and cinnamon/sugar, if desired.\n","ingredients":"Day 1\n1 1/2 cups warm (115º to 118º F) water \n1 tablespoon sugar\n2 teaspoons kosher salt\n2 teaspoons active dry yeast \n2 ½ cups all-purpose flour\n2 cups bread flour\n2 ounces unsalted butter, melted\n1 Ziploc bag\nDay 2\nIngredients\n2 pieces parchment paper\n9 cups water\n½ cup baking soda\n1 egg yolk beaten with 1T water\nKosher salt or coarse salt for topping pretzels \n\nCinnamon/sugar topping for 4 pretzels\n3 T butter, melted\n¼ cup sugar\n2 teaspoons cinnamon\n","picture":"https://handletheheat.com/wp-content/uploads/2021/09/soft-pretzel-recipe-SQUARE.jpg"},
{"id":16,"name":"Buttermilk Pancakes","serving":"4","instructions":"Pancake method:\nPreheat the oven to 200 degrees/175 convection; have a baking sheet/cookie sheet ready to keep cooked pancakes warm in the oven. \n\nIn a large bowl, whisk the buttermilk, the melted butter, and the eggs. Add the dry ingredients to the milk mixture; combine with rubber spatula until just moistened (do not overmix; a few small lumps are fine).\n\nHeat two stainless skillets or pans over 6/medium heat. When the pans are warm (15 seconds) add a couple drops of the oil, spread with a paper towel and give another 20 seconds to heat. You want to feel the warmth of the pan on your hand as you hold your hand OVER the top of the pan. Test the pan: drop 1 teaspoon of batter into pans, is there a sizzle? YES. Then start the pancakes. For each pancake, spoon ⅓ cup of batter onto the skillet. (Start small as you learn to flip the cakes)\n\nCook until the surface of pancakes have some bubbles and a few have burst, 1 to 2 minutes. Flip carefully with a thin spatula, and cook until browned on the underside, 1 to 2 minutes more. \n\nYou may have to adjust the heat for the perfect color pancake and to make sure that it is fully cooked and not raw inside. If the cakes are dark/burned on the outside reduce the heat. \n\nTransfer to a baking sheet or platter; cover loosely with aluminum foil, and keep warm in the oven. Or eat right away. \n\nContinue with more oil and remaining batter.  Serve warm, with desired toppings.\nSyrup method:\nCombine all ingredients in a small saucepan. Bring to a boil, then reduce to a simmer and simmer for 1 minute. If you want your syrup thicker, simmer longer (keep in mind the syrup will get thicker as it cools).\n\nRemove from heat, put a lid on the top to keep warm and set aside.\n","ingredients":"Pancake ingredients\t\t\t\t\t\t\n2 ¼ cups buttermilk\t\t\t\t\t\t\t\n3T (60g) unsalted butter, melted, COOL!!!\t\t\t\n2 large eggs\t\t\t\t\t\t\t\t tasking\t\t\n2 cups flour\t\t\t\t\t\t\t\t\n2 tablespoons sugar\n1 ½ teaspoons baking powder\n1 teaspoon baking soda\n1 teaspoon salt\nVegetable oil, for pan\n\n\nSyrup ingredients\n½ cup white sugar\n½ cup brown sugar\n½ cup water\n¼ t vanilla\n¼ t maple extract\n1 pinch salt","picture":"https://www.allrecipes.com/thmb/FE0PiuuR0Uh06uVh1c2AsKjRGbc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/21014-Good-old-Fashioned-Pancakes-mfs_002-0e249c95678f446291ebc9408ae64c05.jpg"},
{"id":17,"name":"Crepes with Whipped Cream & Berry Compote","serving":"4","instructions":"Method for crepes\nPreheat the oven to 300F to keep crepes warm while cooking. \n\nIn a mixing bowl, combine eggs, milk, water, sugar and cooled melted butter. Add the flour and salt and mix until smooth, this may take a few minutes. You don’t want any, or few, lumps in your batter.\n\nHeat a 10-inch skillet over medium-high heat until just hot enough to sizzle a drop of water. Once the pan is hot a small nub of coconut oil, give the oil about 5 seconds to heat up and then…\n\nFor each crepe pour ¼ cup-ish batter onto the pan while at the same time swirling the pan so the batter reaches the edges. Keep swirling until you don’t have any raw batter moving about. \n\nCook until the edges of the crepes begin to slightly brown, about 3 minutes. Now FLIP! The second side will only need about 30 seconds to finish cooking. Remove from the pan and place on a plate in the oven.\n\nREPEAT: Add ¼ cup batter, swirl, flip, to the oven! Repeat.\n\nMethod for berry compote\nMelt butter in a skillet over medium heat. Stir in brown sugar and lemon juice until sugar has dissolved. Add berries and cook, tossing gently and not mashing berries until berries are warm and juices begin to be released. This will take about 5 minutes. If you’d prefer a thicker, jammier sauce, cook the compote longer until the berry juice is the consistency of syrup. Keep on the stove to stay warm.\n\nBefore eating, pour into a bowl for service and take to the table.\n\nMethod for whipped cream\nFind your largest stainless steel bowl and a whisk. Pour cream and sugar in a bowl and \n\nWHISK, WHISK, WHISK until soft peaks form. Taste and sugar to taste.\n\nPlating\nConsider how you are going to plate your crepes beautifully!\n\nBe sure to dust powdered sugar over them with the sieve for your final touch.\n","ingredients":"Ingredients for crepes\t\t\t\t\t\n2 eggs \t\t\t\t\t\t\t\n½ cup milk\t\t\t\t\t\t\t\n½ cup water\t\t\t\t\t\t\t\n1 tablespoon sugar\t\t\t\t\t\t\n2 tablespoons butter, melted\t\t\t\t\t\n1 cup flour\t\t\t\t\t\t\t\n½ teaspoon salt\n1 teaspoon coconut oil\n\nIngredients for berry compote\t\t\t\t\n2 T butter\t\t\t\t\t\t\t\n1 T brown sugar\t\t\t\t\t\t\n1 T lemon juice\t\t\t\t\t\t\n1.5 cups THAWED mixed berries (or 2 cups frozen)\n\nIngredients for whipped cream\n½ cup whipping cream\n1T powdered sugar, for whipping cream and for plating\n","picture":"https://catzinthekitchen.com/wp-content/uploads/2013/08/Berry-Crepes-3-480x360.jpg"},
{"id":18,"name":"Chewy Chocolate Chip Cookies","serving":"9","instructions":"Position the oven racks in the two middle levels. \n\nPreheat the oven to 340 F convection. \n\nIn a Kitchenaid mixer, with the paddle attachment, mix the melted butter, the white (granulated) sugar, the brown sugar & salt, until lighter in color and a little fluffy, about 2 minutes. \n\nScrape down the sides again and add the vanilla and egg. On medium speed, beat just until combined. Don’t over mix the egg here, nobody wants a tough cookie.\n\nSift the flour, baking soda & baking powder into the wet ingredients and mix on low speed just until combined. \n\nOVEN TEMP CHECK!\n\nRemove the mixing bowl from the machine and fold in the chocolate chips with a wooden spoon/”by hand”. \n\nUsing two spoons (not hands, hands will warm butter up too much and make a flat cookie), divide the dough into 9 dough balls, 4 or 5 dough balls per sheet (no need to use parchment paper or to grease the sheets).\n\nWhen the oven is preheated, place both cookie sheets, side by side on the top rack, into the oven and bake for a total of 10-11 minutes. If they look undercooked continue baking until they are a golden brown color with crispy edges and no doming in the center.\n\nWhen done, remove cookies from the oven, place on top of the oven, cool for 2 minutes, then using a metal spatula remove the cookies and place on cooling racks to cool. \n","ingredients":"½ cup butter (115 grams), melted in pan\n¼ cup granulated sugar (50 grams)\n½ cup brown sugar (110 grams)\n¾ teaspoon salt (4 grams)\t\t\t\t\n1 egg (50 grams cracked)\t\t\t\t\n½ teaspoon vanilla extract\t\t\t\t\n1 ¼ cups flour (156 grams)\n½ teaspoon baking soda (3 grams)\n½ teaspoon baking powder (2 grams)\n4 oz chocolate chips (114 grams)\n","picture":"https://handletheheat.com/wp-content/uploads/2020/10/BAKERY-STYLE-CHOCOLATE-CHIP-COOKIES-9-637x637-1.jpg"},
{"id":19,"name":"Blueberry Crumb Muffins","serving":"9","instructions":"Method for muffins\nPreheat the oven to 375 degrees F convection. Place paper liners into 9 muffin cups.\n\nFor the muffin batter: With a whisk, blend the flour, sugar, baking powder, and salt together in a large bowl. With a fork mix together the oil, the egg and the milk in your 1-cup liquid measuring cup. \n\nPour your wet ingredients into the flour mixture and combine with a rubber spatula then fold in blueberries and set batter aside.\n\nFor the crumb topping\nCombine sugar, flour, butter, and cinnamon in a small bowl. Mix with a fork or fingers until crumbly, not pasty.\n\nAssembling: \nIn your lined muffin tin, evenly distribute batter into the 9 prepared muffin cups. Sprinkle with crumb topping, gently pressing the topping into the batter.\n\nBake in the preheated oven until a butter knife inserted in the center of a muffin comes out clean, 20 minutes.\n","ingredients":"Ingredients for muffin\n1½ cups all-purpose flour\n¾ cup white sugar\n2 teaspoons baking powder\n½ teaspoon salt\n⅓ cup vegetable oil, measured into a 1-cup liquid measuring cup\n1 egg, cracked into the oil\n⅓ cup milk, or more, poured into 1-cup liquid measuring cup to equal 1 cup\n1 cup fresh or frozen blueberries\n\nIngredients for crumb topping\n⅓ cup white sugar\n⅓ cup all-purpose flour\n¼ cup butter, cut into ¼” cubes\n1½ teaspoons ground cinnamon\n","picture":"https://static01.nyt.com/images/2023/04/27/dining/03COOKING-JORDANMARSHMUFFIN2/03COOKING-JORDANMARSHMUFFIN2-square640-v2.jpg"},
{"id":20,"name":"Lemon Gelato","serving":"4","instructions":"\n    In a small heavy saucepan, heat milk to 175°; stir in sugar until dissolved. Whisk a small amount of hot mixture into egg yolks. Return all to the pan, whisking constantly. Add lemon zest. Cook over low heat until mixture is just thick enough to coat a metal spoon and a thermometer reads at least 160°, stirring constantly. Do not allow to boil.\n\n    Remove immediately from heat; stir in lemon juice and cream. Place in a bowl. Press plastic wrap onto surface of custard; refrigerate several hours or overnight.\n\n    Fill cylinder of ice cream maker two-thirds full; freeze according to the manufacturer’s directions. (Refrigerate remaining mixture until ready to freeze.) Transfer ice cream to freezer containers, allowing headspace for expansion. Freeze 2-4 hours or until firm. Repeat with remaining mixture.\n","ingredients":"1 cup whole milk\n1 cup sugar\n    5 large egg yolks, lightly beaten\n    3 tablespoons grated lemon zest\n    3/4 cup fresh lemon juice (about 5 lemons)\n    2 cups heavy whipping cream","picture":"https://www.tasteofhome.com/wp-content/uploads/2024/07/EXPS_TOHD24_35621_AlejandroMonfort_11.jpg?fit=700,1024"},
{"id":21,"name":"Garlic Parmesan Twists","serving":"4","instructions":"    Combine water, sugar and yeast. Let sit until bubbly (about 5 minutes).\n\n    Add oil and salt. Stir in flour.\n\n    Mix until the dough forms into a ball. If the dough is sticky, add additional flour, 1 tablespoon at a time, until the dough comes together. Knead dough on a floured surface for 1-2 minutes.\n\n    Grease bowl with a small amount of olive oil, add the dough, cover the bowl with a damp cloth and put it in a warm area to let it double in size, about 1 hour. \n\n    While dough is resting, mix softened butter, Italian seasoning, and garlic powder in a small bowl. Divide in half, spooning out half into another bowl. You'll use that later.\n\n    Stir in ranch dressing to the first bowl. That will be your spread for the garlic sticks.\n\n    Heat oven to 400 degrees.\n\n    On a lightly floured surface, roll out dough into a 14x16\" rectangle.\n\n    Spread your garlic/ranch/butter mixture evenly across dough.\n\n    Sprinkle with mozzarella cheese.\n\n    Fold dough in half and slice into 8 strips using a pizza cutter.\n\n    Pick up each breadstick with one hand on the top and one hand on the bottom and give it a couple of twists. Set on a lightly greased baking sheet.\n\n    Remember that bowl of butter mixture that you set aside? Go ahead and microwave it until it is melted. Brush on breadsticks.\n\n    Bake breadsticks for 22-25 minutes. Brush again with melted butter mixture. Sprinkle with grated parmesan cheese.","ingredients":"Dough\n    1 ½ cups warm water\n    1 Tbsp. yeast\n    1 teaspoon sugar\n    2 Tbsp. olive oil\n    2 teaspoons kosher salt\n    3 ½ cups flour\n\nFilling\n    ¾ cup softened butter (1 ½ sticks)\n    1 teaspoon garlic powder or minced garlic\n    1 teaspoon dry Italian seasoning\n    ½ cup ranch dressing\n    ¾ cup shredded mozzarella cheese\n    ¼ cup grated parmesan cheese","picture":"https://i0.wp.com/gluesticksblog.com/wp-content/uploads/2014/09/round-table-garlic-ranch-breadsticks-3.jpg?w=650&ssl=1"}
]
